Validation/film/0/T.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 453.03;


boundaryField
{
   upDown
    {
	type	empty;
    }

   right
    {
        type            fixedValue;
        value           uniform 453.03;	
    }
    left
    {     
	type            fixedValue;
        value           uniform 423.03;
    }
   frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
